<h1>Predicting West Nile Virus in Chicago</h1>
<h2>EDA and feature engineering, 2nd round</h2>

In [25]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [26]:
sp = pd.read_csv('./data/spray.csv.zip')
df= pd.read_csv('./data/train.csv.zip')
w = pd.read_csv('./data/weather.csv.zip')

<h2>EDA</h2>

In [27]:
w.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2944 entries, 0 to 2943
Data columns (total 22 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Station      2944 non-null   int64
 1   Date         2944 non-null   object
 2   Tmax         2944 non-null   int64
 3   Tmin         2944 non-null   int64
 4   Tavg         2944 non-null   object
 5   Depart       2944 non-null   object
 6   DewPoint     2944 non-null   int64
 7   WetBulb      2944 non-null   object
 8   Heat         2944 non-null   object
 9   Cool         2944 non-null   object
 10  Sunrise      2944 non-null   object
 11  Sunset       2944 non-null   object
 12  CodeSum      2944 non-null   object
 13  Depth        2944 non-null   object
 14  Water1       2944 non-null   object
 15  SnowFall     2944 non-null   object
 16  PrecipTotal  2944 non-null   object
 17  StnPressure  2944 non-null   object
 18  SeaLevel     2944 non-null   object
 19  ResultSpeed  2944 non-null   float64
 20  ResultDir    2944 non-null   int64
 21  AvgSpeed     2944 non-null   object
dtypes: float64(1), int64(5), object(16)
memory usage: 506.1+ KB

In [28]:
w.head()

,Station,Date,Tmax,Tmin,Tavg,Depart,DewPoint,WetBulb,Heat,Cool,...,CodeSum,Depth,Water1,SnowFall,PrecipTotal,StnPressure,SeaLevel,ResultSpeed,ResultDir,AvgSpeed
0,1,2007-05-01,83,50,67,14,51,56,0,2,...,,0,M,0.0,0.00,29.10,29.82,1.7,27,9.2
1,2,2007-05-01,84,52,68,M,51,57,0,3,...,,M,M,M,0.00,29.18,29.82,2.7,25,9.6
2,1,2007-05-02,59,42,51,-3,42,47,14,0,...,BR,0,M,0.0,0.00,29.38,30.09,13.0,4,13.4
3,2,2007-05-02,60,43,52,M,42,47,13,0,...,BR HZ,M,M,M,0.00,29.44,30.08,13.3,2,13.4
4,1,2007-05-03,66,46,56,2,40,48,9,0,...,,0,M,0.0,0.00,29.39,30.12,11.7,7,11.9

In [29]:
w.Water1.value_counts()

M    2944
Name: Water1, dtype: int64

In [30]:
w = w.replace('M',np.nan)

In [31]:
w.SnowFall.value_counts()

0.0    1459
  T      12
0.1       1
Name: SnowFall, dtype: int64

In [32]:
w.Tavg.unique()

array(['67', '68', '51', '52', '56', '58', nan, '60', '59', '65', '70',
       '69', '71', '61', '55', '57', '73', '72', '53', '62', '63', '74',
       '75', '78', '76', '77', '66', '80', '64', '81', '82', '79', '85',
       '84', '83', '50', '49', '46', '48', '45', '54', '47', '44', '40',
       '41', '38', '39', '42', '37', '43', '86', '87', '89', '92', '88',
       '91', '93', '94', '90', '36'], dtype=object)

In [33]:
w.loc[:,'Tavg'] = w.loc[:,'Tavg'].astype('float')

In [34]:
w.Depart.unique()

array(['14', nan, '-3', ' 2', ' 4', ' 5', '10', '12', '13', '-2', '15',
       '11', '-4', '-6', ' 8', '-5', ' 1', ' 9', ' 6', '-9', '-8', ' 3',
       ' 0', '-1', '-7', ' 7', '-14', '18', '16', '22', '21', '20', '-10',
       '-16', '17', '-12', '-11', '-15', '-17', '19', '-13', '23'],
      dtype=object)

In [35]:
w.loc[:,'Depart'] = w.loc[:,'Depart'].astype('float')

In [36]:
w.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2944 entries, 0 to 2943
Data columns (total 22 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Station      2944 non-null   int64
 1   Date         2944 non-null   object
 2   Tmax         2944 non-null   int64
 3   Tmin         2944 non-null   int64
 4   Tavg         2933 non-null   float64
 5   Depart       1472 non-null   float64
 6   DewPoint     2944 non-null   int64
 7   WetBulb      2940 non-null   object
 8   Heat         2933 non-null   object
 9   Cool         2933 non-null   object
 10  Sunrise      2944 non-null   object
 11  Sunset       2944 non-null   object
 12  CodeSum      2944 non-null   object
 13  Depth        1472 non-null   object
 14  Water1       0 non-null      float64
 15  SnowFall     1472 non-null   object
 16  PrecipTotal  2942 non-null   object
 17  StnPressure  2940 non-null   object
 18  SeaLevel     2935 non-null   object
 19  ResultSpeed  2944 non-null   float64
 20  ResultDir    2944 non-null   int64
 21  AvgSpeed     2941 non-null   object
dtypes: float64(4), int64(5), object(13)
memory usage: 506.1+ KB

In [37]:
w.WetBulb.unique()

array(['56', '57', '47', '48', '50', '49', '46', '54', '53', '62', '63',
       '60', '61', '51', '59', '58', '43', '44', '45', '65', '66', '67',
       '64', '52', '55', '69', '68', '70', '72', '71', '73', '74', '76',
       '42', '39', '40', '41', '35', '33', '34', nan, '75', '36', '32',
       '38', '78', '77', '37'], dtype=object)

In [38]:
w['WetBulb'] = w['WetBulb'].astype('float')

In [39]:
w.Heat.unique()

array(['0', '14', '13', '9', '7', nan, '5', '6', '4', '10', '8', '12',
       '3', '2', '1', '15', '16', '19', '17', '20', '11', '18', '21',
       '25', '24', '27', '26', '23', '28', '22', '29'], dtype=object)

In [40]:
w.Cool.unique()

array([' 2', ' 3', ' 0', nan, ' 5', ' 4', ' 6', ' 8', ' 7', ' 9', '10',
       '13', '11', '12', ' 1', '15', '16', '17', '14', '20', '19', '18',
       '21', '22', '24', '27', '23', '26', '28', '29', '25'], dtype=object)

In [42]:
w['Heat'] = w['Heat'].astype('float')
w['Cool'] = w['Cool'].astype('float')

In [59]:
w.loc[:,'Sunrise':'Sunset'] = w.loc[:,'Sunrise':'Sunset'].replace('-',method='bfill')
w.loc[:,'Sunrise':'Sunset'] = w.loc[:,'Sunrise':'Sunset'].replace('-',method='ffill')
w.loc[:,'Sunrise':'Sunset'].isna().sum()

Sunrise    0
Sunset     0
dtype: int64

In [61]:
w.loc[:,'Sunrise':'Sunset'] = w.loc[:,'Sunrise':'Sunset'].astype('int')

In [24]:
w.loc[:,'Sunrise':'Sunset']

     Sunrise Sunset
0       0448   1849
1        NaN    NaN
2       0447   1850
3        NaN    NaN
4       0446   1851
...      ...    ...
2939     NaN    NaN
2940    0622   1649
2941     NaN    NaN
2942    0623   1647
2943     NaN    NaN

[2944 rows x 2 columns]

In [12]:
sp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14835 entries, 0 to 14834
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       14835 non-null  object
 1   Time       14251 non-null  object
 2   Latitude   14835 non-null  float64
 3   Longitude  14835 non-null  float64
dtypes: float64(2), object(2)
memory usage: 463.7+ KB

In [13]:
sp.head()

         Date        Time   Latitude  Longitude
0  2011-08-29  6:56:58 PM  42.391623 -88.089163
1  2011-08-29  6:57:08 PM  42.391348 -88.089163
2  2011-08-29  6:57:18 PM  42.391022 -88.089157
3  2011-08-29  6:57:28 PM  42.390637 -88.089158
4  2011-08-29  6:57:38 PM  42.390410 -88.088858

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10506 entries, 0 to 10505
Data columns (total 12 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Date                    10506 non-null  object
 1   Address                 10506 non-null  object
 2   Species                 10506 non-null  object
 3   Block                   10506 non-null  int64
 4   Street                  10506 non-null  object
 5   Trap                    10506 non-null  object
 6   AddressNumberAndStreet  10506 non-null  object
 7   Latitude                10506 non-null  float64
 8   Longitude               10506 non-null  float64
 9   AddressAccuracy         10506 non-null  int64
 10  NumMosquitos            10506 non-null  int64
 11  WnvPresent              10506 non-null  int64
dtypes: float64(2), int64(4), object(6)
memory usage: 985.1+ KB

In [15]:
df.head()

,Date,Address,Species,Block,Street,Trap,AddressNumberAndStreet,Latitude,Longitude,AddressAccuracy,NumMosquitos,WnvPresent
0,2007-05-29,"4100 North Oak Park Avenue, Chicago, IL 60634,...",CULEX PIPIENS/RESTUANS,41,N OAK PARK AVE,T002,"4100 N OAK PARK AVE, Chicago, IL",41.954690,-87.800991,9,1,0
1,2007-05-29,"4100 North Oak Park Avenue, Chicago, IL 60634,...",CULEX RESTUANS,41,N OAK PARK AVE,T002,"4100 N OAK PARK AVE, Chicago, IL",41.954690,-87.800991,9,1,0
2,2007-05-29,"6200 North Mandell Avenue, Chicago, IL 60646, USA",CULEX RESTUANS,62,N MANDELL AVE,T007,"6200 N MANDELL AVE, Chicago, IL",41.994991,-87.769279,9,1,0
3,2007-05-29,"7900 West Foster Avenue, Chicago, IL 60656, USA",CULEX PIPIENS/RESTUANS,79,W FOSTER AVE,T015,"7900 W FOSTER AVE, Chicago, IL",41.974089,-87.824812,8,1,0
4,2007-05-29,"7900 West Foster Avenue, Chicago, IL 60656, USA",CULEX RESTUANS,79,W FOSTER AVE,T015,"7900 W FOSTER AVE, Chicago, IL",41.974089,-87.824812,8,4,0

In [16]:


w_1 = w[w['Station']==1].drop('Station',axis=1)
w_2 = w[w['Station']==2].drop('Station',axis=1)

#merging back together on date
w = w_1.merge(w_2, on='Date')

In [17]:
w.head()

,Date,Tmax_x,Tmin_x,Tavg_x,Depart_x,DewPoint_x,WetBulb_x,Heat_x,Cool_x,Sunrise_x,...,CodeSum_y,Depth_y,Water1_y,SnowFall_y,PrecipTotal_y,StnPressure_y,SeaLevel_y,ResultSpeed_y,ResultDir_y,AvgSpeed_y
0,2007-05-01,83,50,67,14,51,56,0,2,0448,...,,NaN,NaN,NaN,0.00,29.18,29.82,2.7,25,9.6
1,2007-05-02,59,42,51,-3,42,47,14,0,0447,...,BR HZ,NaN,NaN,NaN,0.00,29.44,30.08,13.3,2,13.4
2,2007-05-03,66,46,56,2,40,48,9,0,0446,...,HZ,NaN,NaN,NaN,0.00,29.46,30.12,12.9,6,13.2
3,2007-05-04,66,49,58,4,41,50,7,0,0444,...,,NaN,NaN,NaN,0.00,29.36,30.04,10.1,7,10.4
4,2007-05-05,66,53,60,5,38,49,5,0,0443,...,,NaN,NaN,NaN,0,29.46,30.09,11.2,7,11.5

In [19]:
df = df.merge(w,on='Date')

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10506 entries, 0 to 10505
Data columns (total 52 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Date                    10506 non-null  object
 1   Address                 10506 non-null  object
 2   Species                 10506 non-null  object
 3   Block                   10506 non-null  int64
 4   Street                  10506 non-null  object
 5   Trap                    10506 non-null  object
 6   AddressNumberAndStreet  10506 non-null  object
 7   Latitude                10506 non-null  float64
 8   Longitude               10506 non-null  float64
 9   AddressAccuracy         10506 non-null  int64
 10  NumMosquitos            10506 non-null  int64
 11  WnvPresent              10506 non-null  int64
 12  Tmax_x                  10506 non-null  int64
 13  Tmin_x                  10506 non-null  int64
 14  Tavg_x                  10506 non-null  object
 15  Depart_x                10506 non-null  object
 16  DewPoint_x              10506 non-null  int64
 17  WetBulb_x               10413 non-null  object
 18  Heat_x                  10506 non-null  object
 19  Cool_x                  10506 non-null  object
 20  Sunrise_x               10506 non-null  object
 21  Sunset_x                10506 non-null  object
 22  CodeSum_x               10506 non-null  object
 23  Depth_x                 10506 non-null  object
 24  Water1_x                0 non-null      float64
 25  SnowFall_x              10506 non-null  object
 26  PrecipTotal_x           10506 non-null  object
 27  StnPressure_x           10413 non-null  object
 28  SeaLevel_x              10506 non-null  object
 29  ResultSpeed_x           10506 non-null  float64
 30  ResultDir_x             10506 non-null  int64
 31  AvgSpeed_x              10506 non-null  object
 32  Tmax_y                  10506 non-null  int64
 33  Tmin_y                  10506 non-null  int64
 34  Tavg_y                  10506 non-null  object
 35  Depart_y                0 non-null      object
 36  DewPoint_y              10506 non-null  int64
 37  WetBulb_y               10506 non-null  object
 38  Heat_y                  10506 non-null  object
 39  Cool_y                  10506 non-null  object
 40  Sunrise_y               10506 non-null  object
 41  Sunset_y                10506 non-null  object
 42  CodeSum_y               10506 non-null  object
 43  Depth_y                 0 non-null      object
 44  Water1_y                0 non-null      float64
 45  SnowFall_y              0 non-null      object
 46  PrecipTotal_y           10460 non-null  object
 47  StnPressure_y           10506 non-null  object
 48  SeaLevel_y              10506 non-null  object
 49  ResultSpeed_y           10506 non-null  float64
 50  ResultDir_y             10506 non-null  int64
 51  AvgSpeed_y              10506 non-null  object
dtypes: float64(6), int64(12), object(34)
memory usage: 4.2+ MB

In [22]:
df.Block.value_counts()

10    1722
11     736
12     605
22     500
13     345
      ...
27      17
80      13
34       7
55       5
29       3
Name: Block, Length: 64, dtype: int64

In [23]:
df.WnvPresent.corr(df.NumMosquitos)

0.19681956719895316